Revit 2027 API
DrawContext.GetOverrideTransparency Method
 Returns override transparency that will be applied to geometry during rendering.
Namespace: Autodesk.Revit.DB.DirectContext3D
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static bool GetOverrideTransparency(
	out double transparency
)
Public Shared Function GetOverrideTransparency (
	<OutAttribute> ByRef transparency As Double
) As Boolean
public:
static bool GetOverrideTransparency(
	[OutAttribute] double% transparency
)
static member GetOverrideTransparency :
        transparency : float byref -> bool
Parameters
transparency Double
Return Value
Boolean
See Also
Reference
DrawContext Class
Autodesk.Revit.DB.DirectContext3D Namespace